Tekla.Structures.DirectManipulation.Adapter.Picker.PickerHandler
The Tekla.Structures.DirectManipulation.Adapter.Picker.PickerHandler class handles the picking.

Tekla.Structures.DirectManipulation.Adapter.Picker.PickerHandler.#cctor
Initializes static members of the Tekla.Structures.DirectManipulation.Adapter.Picker.PickerHandler class.

Tekla.Structures.DirectManipulation.Adapter.Picker.PickerHandler.#ctor
Initializes a new instance of the Tekla.Structures.DirectManipulation.Adapter.Picker.PickerHandler class.

Tekla.Structures.DirectManipulation.Adapter.Picker.PickerHandler.PickEnded
Occurs when the picking session has ended.

Tekla.Structures.DirectManipulation.Adapter.Picker.PickerHandler.ObjectPicked
Occurs when an object is picked.

Tekla.Structures.DirectManipulation.Adapter.Picker.PickerHandler.ObjectPickUndone
Occurs when a pick is undone.

Tekla.Structures.DirectManipulation.Adapter.Picker.PickerHandler.PickerStarted
Occurs when a picking session has started. The parameter indicates the type of objects that can be picked.

Tekla.Structures.DirectManipulation.Adapter.Picker.PickerHandler.PickPointTolerationRequested
Occurs when the picker is finding a point to snap to.

Tekla.Structures.DirectManipulation.Adapter.Picker.PickerHandler.Imports
Gets the imported picker handler functions.

Tekla.Structures.DirectManipulation.Adapter.Picker.PickerHandler.TryGetPickPointResolveEventArgs(Tekla.BIM.DirectManipulation.Services.Picking.PickPointResolveEventArgs@,System.Int32@)
Tries to get the most recent Tekla.BIM.DirectManipulation.Services.Picking.PickPointResolveEventArgs from TS core.
resolveEventArgs: The resulting event arguments, or null if getting failed.
snappedPointId: The identifier of the snapped point.
Returns: True if the event arguments could be retrieved; otherwise, false.

Tekla.Structures.DirectManipulation.Adapter.Picker.PickerHandler.IsPickedPointOverridden(Tekla.BIM.DirectManipulation.Services.Picking.PickPointResolveEventArgs)
Determines whether the given resolveEventArgs specify an overridden pick point.
resolveEventArgs: The Tekla.BIM.DirectManipulation.Services.Picking.PickPointResolveEventArgs to examine.
Returns: True if the given Tekla.BIM.DirectManipulation.Services.Picking.PickPointResolveEventArgs specify a pick point override; otherwise, false.

Tekla.Structures.DirectManipulation.Adapter.Picker.PickerHandler.OnObjectPicked(System.String)
Raises the ObjectPicked event.
param: Should always be Tekla.Structures.DirectManipulation.Adapter.EventRegistry.PickEvents.ObjectPicked.

Tekla.Structures.DirectManipulation.Adapter.Picker.PickerHandler.OnObjectPickUndone(System.String)
Raises the ObjectPickUndone event.
param: Should always be Tekla.Structures.DirectManipulation.Adapter.EventRegistry.PickEvents.ObjectPickUndone.

Tekla.Structures.DirectManipulation.Adapter.Picker.PickerHandler.OnPickerStarted(System.String)
Raises the Tekla.Structures.DirectManipulation.Adapter.Picker.PickerHandler.PickerStarted event.
param: Should always be Tekla.Structures.DirectManipulation.Adapter.EventRegistry.PickEvents.PickerStarted.

Tekla.Structures.DirectManipulation.Adapter.Picker.PickerHandler.OnPickerEnded(System.String)
Raises the Tekla.Structures.DirectManipulation.Adapter.Picker.PickerHandler.PickEnded event.
param: Should always be Tekla.Structures.DirectManipulation.Adapter.EventRegistry.PickEvents.PickerEnded.

Tekla.Structures.DirectManipulation.Adapter.Picker.PickerHandler.OnPickPointTolerationRequested(System.String)
Raises the Tekla.Structures.DirectManipulation.Adapter.Picker.PickerHandler.PickPointTolerationRequested event.
param: Should always be Tekla.Structures.DirectManipulation.Adapter.EventRegistry.PickEvents.PickPointTolerationRequested.